# Taps
tap "aws/tap"
tap "apparition47/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Binaries
brew "act"
brew "asciidoctor"
brew "awscli"
brew "broot"
brew "cairo"
brew "cocoapods"
brew "dockutil"
# brew "glib"
brew "gh"
brew "ghostscript"
# brew "git-flow-avh"
brew "go"
brew "graphviz"
brew "grpcurl"
brew "harfbuzz"
brew "http-server"
brew "hub"
brew "jq"
brew "mackup"
brew "mas"
brew "pyenv"
# brew "subversion" #tempoary until SVN-based font casks updated
brew "wget"
brew "aws/tap/aws-sam-cli"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Apps
cask "alfred"
# cask "android-studio"
cask "appcleaner"
# cask "balsamiq-wireframes"
# cask "battle-net"
cask "caffeine"
cask "cheatsheet"
cask "clickup"
# cask "delicious-library"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
# cask "flipper"
# cask "franz"
cask "github"
# cask "gitkraken"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graphiql"
cask "iconset"
cask "jetbrains-toolbox"
cask "ksdiff"
# cask "macdown"
# cask "mailtrackerblocker"
cask "microsoft-teams"
# cask "notion"
# cask "obsidian"
cask "postman"
cask "qgis"
# cask "qlmarkdown"
cask "rectangle"
cask "session-manager-plugin"
cask "sketch"
cask "skype"
# cask "slack"
cask "steam"
cask "studio-3t"
cask "superduper"
# cask "swiftbar"
cask "teamviewer"
cask "transmission"
cask "transmit"
cask "tunnelblick"
# cask "upwork"
# cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
# cask "whatsapp"
cask "zoom"
# cask "zulu"
cask "zulu11"
cask "zulu15"

mas "1Password 7", id: 1333542190
mas "Cardhop", id: 1290358394
mas "Clocker", id: 1056643111
mas "Day One", id: 1055511498
mas "Fantastical", id: 975937182
mas "Kaleidoscope", id: 587512244
# mas "Kanbanier", id: 1206854548
mas "Keynote", id: 409183694
# mas "Infuse", id: 1136220934
# mas "Meeter", id: 1510445899
# mas "Menu World Time", id: 1446377255
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
# mas "Marked2", id: 890031187
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator", id: 407963104
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "Tweetbot", id: 1384080005
mas "Ulysses", id: 1225570693
# mas "Usage", id: 1561788435
mas "WhatsApp", id: 1147396723
mas "XCode", id: 497799835
