# Taps
tap "apparition47/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tab "buo/cask-upgrade"

# Binaries
brew "act"
brew "asciidoctor"
brew "python@3.9"
brew "awscli"
brew "aws-sam-cli"
brew "broot"
brew "glib"
brew "cairo"
brew "gnutls"
brew "cask"
brew "cocoapods"
brew "dockutil"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grpcurl"
brew "node"
brew "http-server"
brew "hub"
brew "jq"
brew "mackup"
brew "mas"
brew "pyenv"
brew "subversion"
brew "wget"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Apps
cask "1password"
cask "1password-cli"
cask "alfred"
# cask "android-studio"
cask "amazon-chime"
cask "appcleaner"
# cask "balsamiq-wireframes"
# cask "battle-net"
cask "brave-browser"
cask "caffeine"
cask "cheatsheet"
cask "clickup"
# cask "delicious-library"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "drawio"
# cask "flipper"
# cask "franz"
cask "github"
# cask "gitkraken"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graphiql"
cask "iconset"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "ksdiff"
# cask "macdown"
cask "microsoft-teams"
cask "mimestream"
# cask "notion"
# cask "obsidian"
cask "postman"
cask "qgis"
# cask "qlmarkdown"
cask "rectangle"
cask "session-manager-plugin"
cask "sketch"
cask "skype"
cask "slack"
cask "steam"
cask "studio-3t"
cask "superduper"
# cask "swiftbar"
cask "teamviewer"
cask "transmission"
cask "transmit"
cask "tunnelblick"
# cask "upwork"
# cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "zoom"
cask "zulu"
# cask "zulu15"

mas "1Password for Safari", id: 1569813296
mas "Cardhop", id: 1290358394
mas "Clocker", id: 1056643111
# mas "Craft", id: 1487937127
mas "Day One", id: 1055511498
mas "Fantastical", id: 975937182
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Kanbanier", id: 1206854548
mas "Keynote", id: 409183694
# mas "Infuse", id: 1136220934
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
# mas "Marked2", id: 890031187
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
# mas "Slack", id: 803453959
# mas "Spark", id: 1176895641
mas "TestFlight", id: 899247664
# mas "Tweetbot", id: 1384080005
# mas "Ulysses", id: 1225570693
# mas "Usage", id: 1561788435
mas "Usage", id: 1561788435
mas "WhatsApp", id: 1147396723
mas "XCode", id: 497799835



1136220934  Infuse                    (7.3.10)
975937182   Fantastical               (3.6.4)
1571881224  NBA 2K22 Arcade Edition   (1.0.163706490)
409201541   Pages                     (12.0)
1446377255  Menu World Time           (1.12)
1176895641  Spark                     (2.11.20)
1295203466  Microsoft Remote Desktop  (10.7.6)
803453959   Slack                     (4.26.1)
1510445899  Meeter                    (1.9.6)
1055511498  Day One                   (7.8)
462054704   Microsoft Word            (16.61)
1225570693  Ulysses                   (26)
1289197285  MindNode                  (2022.2.3)
409203825   Numbers                   (12.0)