# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Binaries
brew "asciidoctor"
brew "awscli"
brew "aws-sam-cli"
brew "dockutil"
brew "gh"
brew "ghostscript"
# brew "go"
brew "graphviz"
brew "grpcurl"
brew "node"
brew "http-server"
brew "hub"
brew "jq"
brew "mackup"
brew "mas"
# brew "pyenv"
# brew "ruby"
# brew "rbenv"
brew "wget"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-source-code-pro"

# Apps
# cask "1password"              # Installed by Rippling
cask "1password-cli"
cask "amazon-chime"
cask "appcleaner"
# cask "balsamiq-wireframes"
# cask "battle-net"
cask "brave-browser"
# cask "caffeine"               # Use https://www.caffeine-app.net/ instead
cask "chatgpt"
# cask "delicious-library"
cask "discord"
cask "docker"
# cask "dotnet-sdk"
cask "drawio"
cask "github"
# cask "google-chrome"          # Installed by Rippling
# cask "google-drive"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "ksdiff"
# cask "macdown"
cask "linear"
cask "microsoft-teams"
cask "mimestream"
cask "ngrok"
# cask "notion"
cask "postman"
cask "qgis"
cask "raycast"
cask "session-manager-plugin"
# cask "sketch"
# cask "skype"
# cask "slack"                  # Installed by Rippling
# cask "steam"
cask "studio-3t"
cask "superduper"
# cask "swiftbar"
cask "teamviewer"
cask "transmission"
cask "transmit"
# cask "tunnelblick"
# cask "upwork"
# cask "visual-studio"
# cask "visual-studio-code"       # Installed by Rippling
cask "vlc"
# cask "vmware-fusion"
# cask "zoom"                   # Installed by Rippling
cask "zulu"

mas "1Password for Safari", id: 1569813296
mas "Cardhop", id: 1290358394
mas "Clocker", id: 1056643111
mas "Day One", id: 1055511498
mas "Fantastical", id: 975937182
mas "Goodnotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "MindNode", id: 1289197285
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 1147396723
mas "XCode", id: 497799835

vscode "42crunch.vscode-openapi"
vscode "akamud.vscode-theme-onedark"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dskwrk.vscode-generate-getter-setter"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "humao.rest-client"
vscode "in4margaret.compareit"
vscode "johnpapa.winteriscoming"
vscode "kaleidoscope-app.vscode-ksdiff"
vscode "kasik96.swift"
vscode "lihui.vs-color-picker"
vscode "mechatroner.rainbow-csv"
vscode "minhthai.vscode-todo-parser"
vscode "mintlify.document"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "nrwl.angular-console"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "postman.postman-for-vscode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rubbersheep.gi"
vscode "sleistner.vscode-fileutils"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.vscode-jumpy"
vscode "zhuangtongfa.material-theme"
